Catalogs/НематериальныеАктивы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НематериальныеАктивы</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеСведения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияНМАБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияНМАБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииНМА</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПродукцииРаботДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛиквидационнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияНМАОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостоянияНМАОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийНМА</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетаБухгалтерскогоУчетаНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СчетаБухгалтерскогоУчетаНМА</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КодыОрганизации</Name>
			<Comment>Параметры регистрации и коды организации </Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистрации</Name>
					<Comment>Номер регистрации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемЗарегистрирована</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистрацииПФ</Name>
					<Comment>Номер регистрации в ПФ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистрацииВСлужбеЗанятости</Name>
					<Comment>Номер регистрации в службе занятости</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяИнспекция</Name>
					<Comment>Налоговая инспекция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Comment>Код ЕДРПОУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Индивидуальный налоговый номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Comment>Номер свидетельства</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодЗКГНГ</Name>
					<Comment>Код по ЗКГНГ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСПОДУ</Name>
					<Comment>Код по СПОДУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКВЕД</Name>
					<Comment>Код по КВЕД</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКОАТУУ</Name>
					<Comment>Код по КОАТУУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКФВ</Name>
					<Comment>Код КФВ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФСС</Name>
					<Comment>Номер регистрации ФСС от временной потери трудоспособности</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФССНесчСлучай</Name>
					<Comment>Номер регистрации в ФСС от несчастного случая</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаСобственности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганГУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОПФГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОПФГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОрганаПФУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазваниеРабочегоОрганаФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИОДиректораФонда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассПрофессиональногоРиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганСоциальнойЗащитыНаселения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФССУ</Name>
					<Comment>Номер регистрации ФСС Украины</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКАТОТТГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСостоянийНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСостоянийНМА</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НематериальныеАктивы/Ext/ObjectModule.bsl
#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой инвентарной карточки НМА (форма НА-2)
// Возвращаемое значение:
// Табличный документ - печатная форма инвентарной карточки НМА
Функция ПечатьНА2()
	
	Макет       = ПолучитьМакет("НА2");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма_НА2";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НематериальныйАктив",   Ссылка);
	Запрос.УстановитьПараметр("СостояниеПринятКУчету", Перечисления.ВидыСостоянийНМА.ПринятКУчету);
	Запрос.УстановитьПараметр("СостояниеСписан",       Перечисления.ВидыСостоянийНМА.Списан);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПервоначальныеСведенияНМА_БУ.Организация                             КАК Организация,
	|	ПервоначальныеСведенияНМА_БУ.Организация.НаименованиеПолное          КАК НаименованиеПолноеОрганизации,
	|	КодыОрганизации.КодПоЕДРПОУ                                          КАК КодЕДРПОУ,
	|	ЕСТЬNULL(ПервоначальныеСведенияНМА_БУ.ПервоначальнаяСтоимость, 0)    КАК ПервоначальнаяСтоимость,
	|	ЕСТЬNULL(ПервоначальныеСведенияНМА_БУ.СрокПолезногоИспользования, 0) КАК СрокИспользования,
	|	ЕСТЬNULL(ПервоначальныеСведенияНМА_БУ.ЛиквидационнаяСтоимость, 0)    КАК ЛиквидационнаяСтоимость,
	|	ПринятиеКУчету.РегистраторДата                                       КАК ДатаЗаписи,
	|	ПринятиеКУчету.РегистраторНомер                                      КАК НомерЗаписи,
	|	Списание.РегистраторДата                                             КАК ДатаУбытия,
	|	Списание.РегистраторНомер                                            КАК НомерУбытия,
	|	СчетаУчетаНМА_БУ.СчетУчета                                           КАК СчетУчета
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(, 
	|	                НематериальныйАктив = &НематериальныйАктив) КАК ПервоначальныеСведенияНМА_БУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				СостоянияНМАОрганизаций.Организация         КАК Организация,
	|				СостоянияНМАОрганизаций.НематериальныйАктив КАК НематериальныйАктив,
	|				СостоянияНМАОрганизаций.Регистратор.Дата    КАК РегистраторДата,
	|				СостоянияНМАОрганизаций.Регистратор.Номер   КАК РегистраторНомер
	|			ИЗ
	|				РегистрСведений.СостоянияНМАОрганизаций КАК СостоянияНМАОрганизаций
	|			ГДЕ
	|				СостоянияНМАОрганизаций.Состояние = &СостояниеПринятКУчету
	|				И СостоянияНМАОрганизаций.НематериальныйАктив = &НематериальныйАктив
	|		
	|			УПОРЯДОЧИТЬ ПО
	|				РегистраторДата УБЫВ) КАК ПринятиеКУчету
	|		ПО ПервоначальныеСведенияНМА_БУ.Организация = ПринятиеКУчету.Организация
	|			И ПервоначальныеСведенияНМА_БУ.НематериальныйАктив = ПринятиеКУчету.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				СостоянияНМАОрганизаций.Организация         КАК Организация,
	|				СостоянияНМАОрганизаций.НематериальныйАктив КАК НематериальныйАктив,
	|				СостоянияНМАОрганизаций.Регистратор.Дата    КАК РегистраторДата,
	|				СостоянияНМАОрганизаций.Регистратор.Номер   КАК РегистраторНомер
	|			ИЗ
	|				РегистрСведений.СостоянияНМАОрганизаций КАК СостоянияНМАОрганизаций
	|			ГДЕ
	|				СостоянияНМАОрганизаций.Состояние = &СостояниеСписан
	|				И СостоянияНМАОрганизаций.НематериальныйАктив = &НематериальныйАктив
	|		
	|			УПОРЯДОЧИТЬ ПО
	|				РегистраторДата УБЫВ) КАК Списание
	|		ПО ПервоначальныеСведенияНМА_БУ.Организация = Списание.Организация
	|			И ПервоначальныеСведенияНМА_БУ.НематериальныйАктив = Списание.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(,
	|			                НематериальныйАктив = &НематериальныйАктив) КАК СчетаУчетаНМА_БУ
	|		ПО ПервоначальныеСведенияНМА_БУ.Организация = СчетаУчетаНМА_БУ.Организация
	|			И ПервоначальныеСведенияНМА_БУ.НематериальныйАктив = СчетаУчетаНМА_БУ.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.КодыОрганизации.СрезПоследних(, ) КАК КодыОрганизации
	|		ПО ПервоначальныеСведенияНМА_БУ.Организация = КодыОрганизации.Организация";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Сообщить(НСтр("ru='Нет данных для печати. Актив еще не принят к учету.';uk='Немає даних для друку. Актив ще не прийнятий до обліку.'"));
		Возврат Неопределено;
		
	КонецЕсли;
	
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ОбластьМакета = Макет.ПолучитьОбласть("НА2");
		Параметры     = ОбластьМакета.Параметры;
		Параметры.Заполнить(Выборка);
		Параметры.ИнвентарныйНомер             = СокрЛП(Код);
		Параметры.НаименованиеПолное           = СокрЛП(НаименованиеПолное);
		Параметры.НаименованиеСХарактеристикой = СокрЛП(НаименованиеПолное) 
		                                         + Символы.ПС + СокрЛП(ПрочиеСведения);
		Параметры.ПрочиеСведения = СокрЛП(ПрочиеСведения);
		
		Если Выборка.СрокИспользования = 0 Тогда
			
			Параметры.ГодичнаяСуммаАмортизации = 0;
			
		Иначе
			
			Параметры.ГодичнаяСуммаАмортизации = 12 * (Выборка.ПервоначальнаяСтоимость - Выборка.ЛиквидационнаяСтоимость)
			                                     / Выборка.СрокИспользования; 
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	ТабДокумент.ОбластьПечати = ТабДокумент.Область( , 2, , ТабДокумент.ШиринаТаблицы);
	
	Возврат ТабДокумент
	
КонецФункции  

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура осуществляет печать справочника. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
// Параметры:
//  НазваниеМакета - строка, название макета.
// Возвращаемое значение:
//  Нет.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, ФормаЭлемента = Неопределено) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "НА2" тогда
		
		ТабДокумент = ПечатьНА2();
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, НСтр("ru='Инвентарная карточка НМА (Форма НА-2)';uk='Інвентарна картка НМА (Форма НА-2)'"));

КонецПроцедуры // Печать()

// Возвращает доступные варианты печати справочника.
//
// Вовращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("НА2",НСтр("ru='Форма НА-2';uk='Форма НА-2'"));

КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура проверяет, существуют ли движения в регистрах по данному
// элементу справочника. Если существуют и изменялись определенные реквизиты,
// то запрещает запись.
Процедура ПроверитьВозможностьЗаписиЭлемента(Отказ, Заголовок)
	
	Если ЭтоНовый() или ОбменДанными.Загрузка Тогда
		
		// Проверять нечего
		Возврат
		
	КонецЕсли;
	
	// Получение старых значений
	НалоговоеНазначениеСтарый  = Ссылка.НалоговоеНазначение;
	// Проверка изменений
	ИзмененНалоговоеНазначение = ЗначениеЗаполнено(НалоговоеНазначениеСтарый) И (НалоговоеНазначение <> НалоговоеНазначениеСтарый);
	
	Если ИзмененНалоговоеНазначение Тогда
		
		Если ПолныеПрава.НематериальныеАктивы_БылиДвиженияПоРегистрам(Ссылка) Тогда
			
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='	Нельзя изменять ""Налоговое назначение"",потому что были движения по регистру бухгалтерии ""Хозрасчетный""."
"	Текущее значение <%1> изменяется на старое <%2>.';uk='	Не можна змінювати ""Податкове призначення"",тому що були рухи по регістру бухгалтерії ""Госпрозрахунковий""."
"	Поточне значення <%1> змінюється на старе <%2>.'"), НалоговоеНазначение, НалоговоеНазначениеСтарый);
			ОбщегоНазначения.СообщитьОбОшибке(Сообщение, Отказ, Заголовок);
			НалоговоеНазначение = НалоговоеНазначениеСтарый
		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ПроверитьВозможностьЗаписиЭлемента()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Запись элемента справочника ""%1"" Наим: <%2> код: <%3>:';uk='Запис елемента довідника ""%1"" Найм: <%2> код: <%3>:'"), Метаданные().Представление(), Наименование, Код);
				
	ПроверитьВозможностьЗаписиЭлемента(Отказ, Заголовок)
	
КонецПроцедуры
